app/controllers/twilio_controller.rb

INSERT INTO "person_phone_numbers" ("created_at", "phone_number", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-06-11 00:15:46.737152"], ["phone_number", "7602140707"], ["updated_at", "2014-06-11 00:15:46.737152"]]
SELECT  "person_phone_numbers".* FROM "person_phone_numbers"  WHERE "person_phone_numbers"."phone_number" = '7602140707'  ORDER BY "person_phone_numbers"."id" ASC LIMIT 1
---
  def parse_message
#    if params[:textaction] == "register_person"
#      @person = Person.new( :firstname => params[:firstname], :lastname => params[:lastname], :nickname => params[:nickname])
#      @person.save
#    elsif params[:textaction] == "create_game_session"
      # this shoudl be better way to find by association
#      @person_phone = PersonPhoneNumber.find_by_phone_number( params[:phone_number] )
#      @person_phone.person.create_game_session( params[:sport], params[:location], params[:time])

 #   elsif params[:textaction] == "existing_game_sessions"
 #   elsif params[:textaction] == "join_game_session"
 #   elsif params[:textaction] == "cancel_game_session"
#      @person_phone = PersonPhoneNumber.find_by_phone_number( params[:phone_number] )
#      @person_phone.person.cancel_open_game_session

#    elsif params[:textaction] == "display_game_session_roster"
#    end
#    @people = Person.all

######
    if params[:textmessage] != nil && params[:phone_number] != nil

      # if phone doesnt exist, then create it with empty person_id
      @phone = PersonPhoneNumber.where( :phone_number => params[:phone_number]).first_or_create

INSERT INTO "game_sessions" ("created_at", "location", "owner_id", "request_time", "sport", "start_time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
        @person.set_name(commands[1], commands[2], commands[3])
        @response = "Person first nick and last name set. ID: #{@person.id}. First: #{@person.firstname}. Nick: #{@person.nickname}. Last: #{@person.lastname}."
      elsif commands[0] == "MAKEGAME"
        @gs = @person.create_game_session(commands[1], commands[2], commands[3])

SELECT  "game_sessions".* FROM "game_sessions"  WHERE "game_sessions"."id" = $1 LIMIT 1  [["id", 3]]
---
          @response = "No open game sessions to cancel!"
        end
      elsif commands[0] == "JOINGAME"
        @gs = GameSession.find(commands[1] )